<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>Лабораторная работа №2.Составление программы, взаимодействующей с пользователем</title>
	<link rel="stylesheet" href="css/bootstrap.min.css">
</head>
<body>
	<div class="container">
		<p></p>
		<p class="text-uppercase"><b>Лабораторная работа №2.Составление программы, взаимодействующей с пользователем</b></p>
		
		<p><b>Цель работы:</b> Составить программу, взаимодействующая с пользователем</p>
		<p><b>Теоретическая часть</b></p>

		<p><em>Текстовый интерфейс пользователя</em> (англ. Text user interface, TUI; также Character User Interface, CUI) — система средств взаимодействия пользователя с компьютером, основанная на использовании текстового (буквенно-цифрового) режима дисплея или аналогичных устройств — например, командная строка. Приложения, использующие текстовый интерфейс, называют консольными программами.</p>
		<p>На программном уровне для ввода и вывода информации консольные программы используют стандартные устройства ввода-вывода (stdin, stdout, stderr), хотя могут открывать и другие файлы, сетевые соединения и совершать иные действия, доступные в выполняющей их среде. Вывод печатных символов в stdout и stderr приводит к появлению этих символов на устройстве вывода, то есть к их получению пользователем.</p>
		<p>В простейшем случае консольная программа использует интерфейс командной строки, однако многие из таких программ с помощью управляющих последовательностей терминалов создают более дружественный интерфейс, приближающийся к графическому</p>

		<p>Основной задачей программирования является обработка информации,
		поэтому любой язык программирования имеет средства для ввода и вывода информации.</p>
		<p>Ввод и вывод информации осуществляется через функции стандартной библиотеки. Прототипы рассматриваемых функций находятся в файле stdio.h.</p>
		<p>Эта библиотека содержит функции</p>
		<ul>
			<li>printf() - для вывода информации</li>
			<li>scanf() - для ввода информации.</li>
		</ul>

		<p><b>Вывод информации</b></p>
		<p>Функция printf() предназначена для форматированного вывода. Она переводит данные в символьное представление и выводит полученные изображения символов на экран. При этом у программиста имеется возможность форматировать данные, то есть влиять на их представление
		на экране.</p>
		
		<p>Общая форма записи функции printf(): printf("СтрокаФорматов", объект1, объект2, ..., объектn);</p>
		<p>СтрокаФорматов состоит из следующих элементов:</p>
		<ul>
			<li>управляющих символов (например: \n - перевод строки);</li>
			<li>текста, представленного для непосредственного вывода;</li>
			<li>форматов, предназначенных для вывода значений переменных различных типов.</li>
		</ul>
		<p>Объекты могут отсутствовать.</p>
		<p>Форматы нужны для того, чтобы указывать вид, в котором информация будет выведена на экран. Отличительной чертой формата является наличие символа процент '%' перед ним:</p>
		<ul>
			<li>%d — целое число типа int со знаком в десятичной системе счисления;</li>
			<li>%f — вещественный формат (числа с плавающей точкой типа float);</li>
			<li>%c — символьный формат;</li>
			<li>%s — строковый формат.</li>
		</ul>
		
		<p>При указании формата можно явным образом указать общее количество знакомест и количество знакомест, занимаемых дробной частью (пример в Исходном коде программы 2)</p>
		<p><b>Ввод информации</b></p>
		<p>Функция форматированного ввода данных с клавиатуры scanf() выполняет чтение данных, вводимых с клавиатуры, преобразует их во внутренний формат и передает вызывающей функции. При этом программист задает правила интерпретации входных данных с помощью спецификаций форматной строки.</p>
		<p>Общая форма записи функции scanf( ): scanf ("CтрокаФорматов", адрес1, адрес2,...);</p>
		<p>Строка форматов аналогична функции printf().
		Для формирования адреса переменной используется символ амперсанд '&':
		адрес = &объект</p>
		<p>Строка форматов и список аргументов для функции обязательны.</p>

		<p><b>Практическая часть</b></p>
		<p>Исходный код программы 1:</p>
		<pre>
			#include &ltstdio.h&gt
			
			int main(){
			  int a = 5;
			  float x = 2.78;
			  printf("a=%d\n", a);
			  printf("x=%f\n", x);
			  getchar();
			  return 0;
			}
		</pre>

		<p>Исходный код программы 2:</p>
		<pre>
			#include &ltstdio.h&gt
			
			int main(){
			  float x = 1.2345;
			  printf("x=%10.5f\n", x);
			  getchar();
			  return 0;
			}
		</pre>

		<p>Исходный код программы 3:</p>
		<pre>
			#include &ltstdio.h&gt
			#include &ltstdlib.h&gt
			
			int main(){
			  system("chcp 1251");
			  system("cls");
			  float y;
			  printf("Введите y: ");
			  scanf("%f", &y);
			  printf("Значение переменной y=%f", y);
			  getchar();
			  return 0;
			}
		</pre>

	</div>
	<script>

    document.ondragstart = noselect;

    document.onselectstart = noselect;

    document.oncontextmenu = noselect;

    function noselect() {return false;}

</script>
</body>
</html>